lib/xml/createInboundCampaign.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createInboundCampaign>
            <!--Optional:-->
            <campaign>
                <!--Optional:-->
                <description>?</description>
                <!--Optional:-->
                <mode>?</mode>
                <!--Optional:-->
                <name>?</name>
                <!--Optional:-->
                <profileName>?</profileName>
                <!--Optional:-->
                <state>?</state>
                <!--Optional:-->
                <trainingMode>?</trainingMode>
                <!--Optional:-->
                <type>?</type>
                <!--Optional:-->
                <autoRecord>?</autoRecord>
                <!--Optional:-->
                <callWrapup>
                    <!--Optional:-->
                    <agentNotReady>?</agentNotReady>
                    <!--Optional:-->
                    <dispostionName>?</dispostionName>
                    <!--Optional:-->
                    <enabled>?</enabled>
                    <!--Optional:-->
                    <reasonCodeName>?</reasonCodeName>
                    <!--Optional:-->
                    <timeout>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </timeout>
                </callWrapup>
                <!--Optional:-->
                <ftpHost>?</ftpHost>
                <!--Optional:-->
                <ftpPassword>?</ftpPassword>
                <!--Optional:-->
                <ftpUser>?</ftpUser>
                <!--Optional:-->
                <recordingNameAsSid>?</recordingNameAsSid>
                <!--Optional:-->
                <useFtp>?</useFtp>
                <!--Optional:-->
                <defaultIvrSchedule>
                    <!--Optional:-->
                    <ivrSchedule>
                        <!--Optional:-->
                        <name>?</name>
                        <!--Optional:-->
                        <scriptName>?</scriptName>
                        <!--Zero or more repetitions:-->
                        <scriptParameters>
                            <!--Optional:-->
                            <name>?</name>
                            <!--Optional:-->
                            <value>?</value>
                        </scriptParameters>
                    </ivrSchedule>
                    <!--Optional:-->
                    <visualModeSettings>
                        <!--Optional:-->
                        <callbackEnabled>?</callbackEnabled>
                        <!--Optional:-->
                        <chatEnabled>?</chatEnabled>
                        <!--Optional:-->
                        <cssTheme>?</cssTheme>
                        <!--Optional:-->
                        <emailEnabled>?</emailEnabled>
                        <!--Optional:-->
                        <sentimentFeedbackEnabled>?</sentimentFeedbackEnabled>
                        <!--Optional:-->
                        <videoEnabled>?</videoEnabled>
                        <!--Optional:-->
                        <visualModeEnabled>?</visualModeEnabled>
                        <!--Optional:-->
                        <xFrameOption>?</xFrameOption>
                        <!--Optional:-->
                        <xFrameOptionUrl>?</xFrameOptionUrl>
                        <!--Optional:-->
                        <xFrameOptionsEnabled>?</xFrameOptionsEnabled>
                    </visualModeSettings>
                </defaultIvrSchedule>
                <!--Optional:-->
                <maxNumOfLines>?</maxNumOfLines>
            </campaign>
        </ser:createInboundCampaign>
    </soapenv:Body>
</soapenv:Envelope>